---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailProfile
source: html/00f3aeb4-8b39-c3ee-245d-2ddc1c478eb1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BadRailProfile Property

One or more Profile Loops are invalid, probably because of self-intersection.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadRailProfile { get; }
```